package com.hanhe.study.hodgepodge;

public class Maze {
    /*
        https://www.nowcoder.com/practice/037dc00d6e3442f185cf4cde359ba460?tpId=90&tqId=30982&rp=1&ru=/activity/oj&qru=/ta/2018test/question-ranking

        受到小人的设计，主人公暮小云落入一个名为神凛幻域的奇特地方。对于迷失在这里的人而言这个空间没有绝对的方向，想要脱离这个地方就必须向前走出n步。
        由于在这个空间内没有方向的概念，无论何时向任何方向迈出一步都是等效的（哪怕你是原地转圈，只要走出N步即可脱离幻境）。
        不过，由于空间壁垒的原因，不同时刻向不同方向走所耗费的体力不同。现在已知不同时刻向某个方向跨出一步所需耗费的体力，
        请你告诉暮小云怎么走最省体力，以及需要耗费的最小体力。

        输入描述:
        有多个输入样例，输入的第一行是样例个数T(1≤T≤50)。
        每个样例的第一行是一个整数n(1≤n≤100000)。紧接着是四行，
        依次表示东南西北四个方向的体力耗费情况，
        每行n个数字，
        分别表示第n步向该方向走需要花费的体力值 xi(0≤xi≤1000000)。
        某一步的多个方向体力值均为最小值时按照东南西北的顺序取优先方向。

        输出描述:
        第一行输出需要的最小体力值，第二行输出行走方案分别用符号 E S W N 表示东南西北。
    */


}
